nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]   # Nano
  s: [0.50, 0.50, 1024]   # Small
  l: [1.00, 1.00, 512]    # Large
  x: [1.00, 1.50, 512]    # Extra Large

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]       # 1-P2/4
  - [-1, 2, DSC3k2,  [256, False, 0.25]]    # 2
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]       # 3-P3/8
  - [-1, 2, DSC3k2,  [512, False, 0.25]]    # 4 (原 P3 特征)
  - [-1, 1, DSConv,  [512, 3, 2]]           # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]          # 6 (原 P4 特征)
  - [-1, 1, DSConv,  [1024, 3, 2]]          # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]         # 8 (原 P5 特征)
  - [-1, 1, SOCA, [1024]]                   # 9 (插入 SOCA，作为新的 P5 输出)

head:
  # 注意：由于插入了 SOCA(层9)，Head 部分所有索引均+1，引用层数也需更新
  # 原输入 [4, 6, 8] -> 现输入 [4, 6, 9] (引用 SOCA 的输出)
  - [[4, 6, 9], 2, HyperACE, [512, 8, True, True, 0.5, 1, "both"]] # 10 (原9)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                     # 11 (原10)
  # 原引用 [9] -> 现引用 [10] (HyperACE)
  - [ 10, 1, DownsampleConv, []]                                   # 12 (原11)

  # FullPAD_Tunnel 索引更新：
  # 原 [6, 9] -> 现 [6, 10]
  - [[6, 10], 1, FullPAD_Tunnel, []]                               # 13 (原12)
  # 原 [4, 10] -> 现 [4, 11]
  - [[4, 11], 1, FullPAD_Tunnel, []]                               # 14 (原13)
  # 原 [8, 11] -> 现 [9, 12] (8变成9-SOCA, 11变成12-DownsampleConv)
  - [[9, 12], 1, FullPAD_Tunnel, []]                               # 15 (原14)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                     # 16 (原15)
  # 原引用 [-1, 12] -> [-1, 13]
  - [[-1, 13], 1, Concat, [1]] # cat backbone P4                   # 17 (原16)
  - [-1, 2, DSC3k2, [512, True]]                                   # 18 (原17)
  # 原引用 [-1, 9] -> [-1, 10] (HyperACE)
  - [[-1, 10], 1, FullPAD_Tunnel, []]                              # 19 (原18)

  # 原引用 17 -> 18
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]                     # 20 (原19)
  # 原引用 [-1, 13] -> [-1, 14]
  - [[-1, 14], 1, Concat, [1]] # cat backbone P3                   # 21 (原20)
  - [-1, 2, DSC3k2, [256, True]]                                   # 22 (原21)
  # 原引用 10 -> 11
  - [11, 1, Conv, [256, 1, 1]]                                     # 23 (原22)
  # 原引用 [21, 22] -> [22, 23]
  - [[22, 23], 1, FullPAD_Tunnel, []]                              # 24 (原23)

  - [-1, 1, Conv, [256, 3, 2]]                                     # 25 (原24)
  # 原引用 [-1, 18] -> [-1, 19]
  - [[-1, 19], 1, Concat, [1]] # cat head P4                       # 26 (原25)
  - [-1, 2, DSC3k2, [512, True]]                                   # 27 (原26)
  # 原引用 [-1, 9] -> [-1, 10]
  - [[-1, 10], 1, FullPAD_Tunnel, []]                              # 28 (原27)

  # 原引用 26 -> 27
  - [27, 1, Conv, [512, 3, 2]]                                     # 29 (原28)
  # 原引用 [-1, 14] -> [-1, 15]
  - [[-1, 15], 1, Concat, [1]] # cat head P5                       # 30 (原29)
  - [-1, 2, DSC3k2, [1024,True]]                                   # 31 (原30)
  # 原引用 [-1, 11] -> [-1, 12]
  - [[-1, 12], 1, FullPAD_Tunnel, []]                              # 32 (原31)

  # Detect 层索引更新：
  # 原 [23, 27, 31] -> 现 [24, 28, 32]
  - [[24, 28, 32], 1, Detect, [nc]] # Detect(P3, P4, P5)           # 33 (原32)
